trainings = {
    "test":        "Тестировщик",
    "proj":        "Project менеджер",
    "design":      "Дизайнер",
    "a_prog":      "Android разработчик",
    "i_prog":      "IOS разработчик",
    "anal":        "Аналитик данных",
    "backend":     "Backend разработчик",
    "talk_design": "Разговорный дизайнер ",
}

prof_test_data = {
    "tech": ["test", "a_prog", "i_prog", "backend", "anal"],
    "desi": ["design", "talk_design"],
    "mngr": ["proj"]
}


questions = [
  {
    "q": "Что тебе больше нравится делать?",
    "tech": "A - Писать код и разрабатывать программы.",
    "desi": "B - Создавать визуальные концепции и проекты.",
    "mngr": "C -Планировать и организовывать работу команды."
  },
  {
    "q": "Какую деятельность ты предпочитаешь?",
    "tech": "A - Разработка программного обеспечения.",
    "desi": "B - Графический дизайн и веб-дизайн.",
    "mngr": "C - Управление проектами и командами."
  },
  {
    "q": "В какой сфере ты хотел бы развиваться?",
    "tech": "A - Информационные технологии и программирование.",
    "desi": "B - Креатив и дизайн.",
    "mngr": "C - Менеджмент и лидерство."
  },
  {
    "q": "Какой результат работы для тебя важнее всего?",
    "tech": "A - Создание функционального приложения или системы.",
    "desi": "B - Красивый и удобный интерфейс или продукт.",
    "mngr": "C - Эффективность и успех проекта."
  },
  {
    "q": "Какая рабочая среда тебе ближе?",
    "tech": "A - IT-компания или стартап в области технологий.",
    "desi": "B - Дизайнерское агентство или креативное пространство.",
    "mngr": "C - Корпоративный офис или проектная команда."
  }
]
